OpenFOAM-v1812/tutorials/multiphase/potentialFreeSurfaceFoam/oscillatingBox/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.1 0.8 -100) (0.4 100 100);
    }

    {
        name    c0;
        type    cellSet;
        action  invert;
    }

    {
        name    f0FaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   freeSurface;
    }

    {
        name    f0FaceSet;
        type    faceSet;
        action  subset;
        source  boxToFace;
        box     (-100 0.9 -100) (0.2 100 100);
    }

    {
        name    f0;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet f0FaceSet;
    }
);


// ************************************************************************* //
